# MarkupsPrivate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MarkupsPrivate Property
ParameterTypeId Class See Also
---
"Private"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MarkupsPrivate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MarkupsPrivate As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MarkupsPrivate {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace